Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MIMXRT1021xxxxx
package_id: MIMXRT1021DAG5A
mcu_data: ksdk2_0
processor_version: 16.3.0
board: MIMXRT1020-EVK
external_user_signals: {}
pin_labels:
- {pin_num: '14', pin_signal: GPIO_EMC_04, label: LED_OUT1, identifier: PWM_OUT1;LED_OUT1}
- {pin_num: '18', pin_signal: GPIO_EMC_00, label: DI_Scram, identifier: SEMC_D0;DI_Scram}
- {pin_num: '17', pin_signal: GPIO_EMC_01, label: DI_SPD, identifier: SEMC_D1;DI_SPD}
- {pin_num: '16', pin_signal: GPIO_EMC_02, label: 'SEMC_D2/U14[5]', identifier: IIC1_SCL}
- {pin_num: '15', pin_signal: GPIO_EMC_03, label: 'SEMC_D3/U14[7]', identifier: IIC1_SDA}
- {pin_num: '13', pin_signal: GPIO_EMC_05, label: LED_OUT2, identifier: SEMC_D5;PWM_OUT2;LED_OUT2}
- {pin_num: '12', pin_signal: GPIO_EMC_06, label: 'SEMC_D6/U14[11]', identifier: UART3_TX}
- {pin_num: '10', pin_signal: GPIO_EMC_07, label: 'SEMC_D7/U14[13]', identifier: UART3_RX}
- {pin_num: '9', pin_signal: GPIO_EMC_08, label: CAN2_TX, identifier: SEMC_DM0;CAN2_TX}
- {pin_num: '8', pin_signal: GPIO_EMC_09, label: CAN2_RX, identifier: SEMC_WE;CAN2_RX}
- {pin_num: '7', pin_signal: GPIO_EMC_10, label: LED_OUT3, identifier: SEMC_CAS;PWM_OUT3;LED_OUT3}
- {pin_num: '4', pin_signal: GPIO_EMC_11, label: LED_OUT4, identifier: SEMC_RAS;PWM_OUT4;LED_OUT4}
- {pin_num: '3', pin_signal: GPIO_EMC_12, label: 'SEMC_CS0/U14[19]', identifier: UART6_TX}
- {pin_num: '2', pin_signal: GPIO_EMC_13, label: 'SEMC_BA0/U14[20]', identifier: UART6_RX}
- {pin_num: '1', pin_signal: GPIO_EMC_14, label: HW_VER, identifier: HW_VER2}
- {pin_num: '143', pin_signal: GPIO_EMC_15, label: HW_VER, identifier: HW_VER1}
- {pin_num: '142', pin_signal: GPIO_EMC_16, label: K8, identifier: SEMC_A0;K8}
- {pin_num: '141', pin_signal: GPIO_EMC_17, label: K7, identifier: SEMC_A1;K7}
- {pin_num: '140', pin_signal: GPIO_EMC_18, label: LED_OUT5, identifier: SEMC_A2;PWM_OUT5;LED_OUT5}
- {pin_num: '139', pin_signal: GPIO_EMC_19, label: LED_OUT6, identifier: SEMC_A3;PWM_OUT6;LED_OUT6}
- {pin_num: '138', pin_signal: GPIO_EMC_20, label: K6, identifier: K6}
- {pin_num: '137', pin_signal: GPIO_EMC_21, label: K5, identifier: K5}
- {pin_num: '136', pin_signal: GPIO_EMC_22, label: CD4052B_CHA, identifier: UART2_TX;CD4052_CHA}
- {pin_num: '133', pin_signal: GPIO_EMC_23, label: CD4052B_CHB, identifier: UART2_RX;CD4052_CHB}
- {pin_num: '132', pin_signal: GPIO_EMC_24, label: K4, identifier: K4}
- {pin_num: '131', pin_signal: GPIO_EMC_25, label: K3, identifier: K3}
- {pin_num: '130', pin_signal: GPIO_EMC_26, label: K2, identifier: K2}
- {pin_num: '129', pin_signal: GPIO_EMC_27, label: K1, identifier: K1}
- {pin_num: '128', pin_signal: GPIO_EMC_28, label: IO_ADD1}
- {pin_num: '127', pin_signal: GPIO_EMC_29, label: IO_ADD2, identifier: SEMC_CKE;IO_ADD2}
- {pin_num: '126', pin_signal: GPIO_EMC_30, label: IO_ADD3, identifier: SEMC_CLK;IO_ADD3}
- {pin_num: '125', pin_signal: GPIO_EMC_31, label: IO_ADD4, identifier: SEMC_DM1;IO_ADD4}
- {pin_num: '124', pin_signal: GPIO_EMC_32, label: 'SEMC_D8/U14[42]', identifier: UART4_TX}
- {pin_num: '123', pin_signal: GPIO_EMC_33, label: 'SEMC_D9/U14[44]', identifier: UART4_RX}
- {pin_num: '122', pin_signal: GPIO_EMC_34, label: 'SEMC_D10/U14[45]', identifier: WDI_PFO}
- {pin_num: '121', pin_signal: GPIO_EMC_35, label: DI_Hit, identifier: SEMC_D11;DI_Hit}
- {pin_num: '120', pin_signal: GPIO_EMC_36, label: DI_Water, identifier: SEMC_D12;DI_Water}
- {pin_num: '119', pin_signal: GPIO_EMC_37, label: DI_Door, identifier: SEMC_D13;DI_Door}
- {pin_num: '118', pin_signal: GPIO_EMC_38, label: 'SEMC_D14/U14[51]', identifier: UART5_TX}
- {pin_num: '117', pin_signal: GPIO_EMC_39, label: 'SEMC_D15/U14[53]', identifier: UART5_RX}
- {pin_num: '109', pin_signal: GPIO_AD_B0_02, label: GND, identifier: RS485_EN1}
- {pin_num: '108', pin_signal: GPIO_AD_B0_03, label: 'JTAG_TDI/J16[5]/WDOG_B', identifier: WDOG_B}
- {pin_num: '107', pin_signal: GPIO_AD_B0_04, label: 'JTAG_TDO/J16[13]/ENET_RST/U11[32]', identifier: ENET_RST;PHY_RST}
- {pin_num: '106', pin_signal: GPIO_AD_B0_05, label: USER_LED, identifier: RUN_LED}
- {pin_num: '100', pin_signal: GPIO_AD_B0_08, label: 'ENET_TX_CLK/U11[9]', identifier: ENET_TX_CLK}
- {pin_num: '99', pin_signal: GPIO_AD_B0_09, label: 'ENET_RXD1/U11[15]/J17[3]', identifier: ENET_RXD1}
- {pin_num: '92', pin_signal: GPIO_AD_B1_00, label: DI_FU1_FB, identifier: DI_FU1_FB}
- {pin_num: '91', pin_signal: GPIO_AD_B1_01, label: DI_FU2_FB, identifier: DI_FU2_FB}
- {pin_num: '90', pin_signal: GPIO_AD_B1_02, label: DI_K1_FB, identifier: DI_K1_FB}
- {pin_num: '89', pin_signal: GPIO_AD_B1_03, label: DI_K2_FB, identifier: DI_K2_FB}
- {pin_num: '88', pin_signal: GPIO_AD_B1_04, label: DI_K3_FB, identifier: DI_K3_FB}
- {pin_num: '87', pin_signal: GPIO_AD_B1_05, label: DI_K4_FB, identifier: DI_K4_FB}
- {pin_num: '84', pin_signal: GPIO_AD_B1_06, label: 'ENET_INT/U11[21]/J17[8]', identifier: ENET_INT;PHY_INT}
- {pin_num: '83', pin_signal: GPIO_AD_B1_07, label: DI_MCB, identifier: DI_MCB}
- {pin_num: '80', pin_signal: GPIO_AD_B1_10, label: 'USB_OTG1_PWR/J18[1]', identifier: ADCY}
- {pin_num: '79', pin_signal: GPIO_AD_B1_11, label: 'USB_OTG1_ID/J18[2]', identifier: ADCX}
- {pin_num: '78', pin_signal: GPIO_AD_B1_12, label: 'USB_OTG1_OC/J18[3]', identifier: ADC_G1_T1}
- {pin_num: '76', pin_signal: GPIO_AD_B1_13, label: 'CAN_STBY/J18[4]', identifier: ADC_G1_T2}
- {pin_num: '75', pin_signal: GPIO_AD_B1_14, label: 'I2C1_SCL/U10[17]/J18[6]', identifier: ADC_G2_T1}
- {pin_num: '74', pin_signal: GPIO_AD_B1_15, label: 'I2C1_SDA/U10[18]/J18[5]', identifier: ADC_G2_T2}
- {pin_num: '48', pin_signal: GPIO_SD_B0_00, label: RS485_EN2, identifier: IIC3_SCL;RS485_EN2}
- {pin_num: '47', pin_signal: GPIO_SD_B0_01, label: FAN, identifier: IIC3_SDA;FAN}
- {pin_num: '46', pin_signal: GPIO_SD_B0_02, label: DI_GUN1_FB, identifier: SD1_CMD;DI_GUN1_FB}
- {pin_num: '45', pin_signal: GPIO_SD_B0_03, label: DI_GUN2_FB, identifier: SD1_CLK;DI_GUN2_FB}
- {pin_num: '43', pin_signal: GPIO_SD_B0_04, label: 'SD1_D0/J15[7]', identifier: UART7_TX}
- {pin_num: '42', pin_signal: GPIO_SD_B0_05, label: 'SD1_D1/J15[8]', identifier: UART7_RX}
- {pin_num: '41', pin_signal: GPIO_SD_B0_06, label: RS485_EN3, identifier: RS485_EN2;RS485_EN3}
- {pin_num: '30', pin_signal: GPIO_SD_B1_02, label: I2C4_SCL, identifier: UART8_TX}
- {pin_num: '26', pin_signal: GPIO_SD_B1_05, label: RS485_EN2, identifier: RS485_EN3}
- {pin_num: '27', pin_signal: GPIO_SD_B1_04, label: RS485_EN4, identifier: RS485_EN4}
- {pin_num: '28', pin_signal: GPIO_SD_B1_03, label: I2C4_SDA, identifier: UART8_RX}
- {pin_num: '81', pin_signal: GPIO_AD_B1_09, label: 'SEMC_A7/U14[32]/BT_CFG[5]', identifier: CD4052_CHB;UART2_RX}
- {pin_num: '82', pin_signal: GPIO_AD_B1_08, label: 'SEMC_A6/U14[31]/BT_CFG[4]', identifier: CD4052_CHA;UART2_TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

