Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '106', peripheral: GPIO1, signal: 'gpio_io, 05', pin_signal: GPIO_AD_B0_05, direction: OUTPUT, pull_keeper_enable: Disable}
  - {pin_num: '105', peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_06, pull_keeper_enable: Disable}
  - {pin_num: '101', peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_07, pull_keeper_enable: Disable}
  - {pin_num: '136', peripheral: GPIO2, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_22, identifier: CD4052_CHA, direction: OUTPUT, pull_keeper_enable: Disable}
  - {pin_num: '133', peripheral: GPIO2, signal: 'gpio_io, 23', pin_signal: GPIO_EMC_23, identifier: CD4052_CHB, direction: OUTPUT, pull_keeper_enable: Disable}
  - {pin_num: '12', peripheral: LPUART3, signal: TX, pin_signal: GPIO_EMC_06, pull_keeper_enable: Disable}
  - {pin_num: '10', peripheral: LPUART3, signal: RX, pin_signal: GPIO_EMC_07, pull_keeper_enable: Disable}
  - {pin_num: '123', peripheral: LPUART4, signal: RX, pin_signal: GPIO_EMC_33, pull_keeper_enable: Disable}
  - {pin_num: '124', peripheral: LPUART4, signal: TX, pin_signal: GPIO_EMC_32, pull_keeper_enable: Disable}
  - {pin_num: '117', peripheral: LPUART5, signal: RX, pin_signal: GPIO_EMC_39, pull_keeper_enable: Disable}
  - {pin_num: '118', peripheral: LPUART5, signal: TX, pin_signal: GPIO_EMC_38, pull_keeper_enable: Disable}
  - {pin_num: '2', peripheral: LPUART6, signal: RX, pin_signal: GPIO_EMC_13, pull_keeper_enable: Disable}
  - {pin_num: '3', peripheral: LPUART6, signal: TX, pin_signal: GPIO_EMC_12, pull_keeper_enable: Disable}
  - {pin_num: '42', peripheral: LPUART7, signal: RX, pin_signal: GPIO_SD_B0_05, pull_keeper_enable: Disable}
  - {pin_num: '43', peripheral: LPUART7, signal: TX, pin_signal: GPIO_SD_B0_04, pull_keeper_enable: Disable}
  - {pin_num: '30', peripheral: LPUART8, signal: TX, pin_signal: GPIO_SD_B1_02, pull_keeper_select: Keeper, pull_keeper_enable: Disable, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '28', peripheral: LPUART8, signal: RX, pin_signal: GPIO_SD_B1_03, pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: '48', peripheral: GPIO3, signal: 'gpio_io, 13', pin_signal: GPIO_SD_B0_00, identifier: RS485_EN2, direction: OUTPUT, software_input_on: Disable, open_drain: Disable,
    pull_keeper_select: Pull, pull_keeper_enable: Disable, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '47', peripheral: TMR2, signal: 'TIMER_OUTPUT, 2', pin_signal: GPIO_SD_B0_01, identifier: FAN, software_input_on: Disable, open_drain: Disable, pull_keeper_select: Keeper,
    pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '16', peripheral: LPI2C1, signal: SCL, pin_signal: GPIO_EMC_02, software_input_on: Enable, open_drain: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    pull_up_down_config: Pull_Up_22K_Ohm}
  - {pin_num: '15', peripheral: LPI2C1, signal: SDA, pin_signal: GPIO_EMC_03, software_input_on: Enable, open_drain: Enable, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    pull_up_down_config: Pull_Up_22K_Ohm}
  - {pin_num: '32', peripheral: CAN1, signal: RX, pin_signal: GPIO_SD_B1_01, pull_keeper_enable: Disable}
  - {pin_num: '33', peripheral: CAN1, signal: TX, pin_signal: GPIO_SD_B1_00, pull_keeper_enable: Disable}
  - {pin_num: '8', peripheral: CAN2, signal: RX, pin_signal: GPIO_EMC_09, identifier: CAN2_RX, pull_keeper_enable: Disable}
  - {pin_num: '9', peripheral: CAN2, signal: TX, pin_signal: GPIO_EMC_08, identifier: CAN2_TX, pull_keeper_enable: Disable}
  - {pin_num: '109', peripheral: GPIO1, signal: 'gpio_io, 02', pin_signal: GPIO_AD_B0_02, direction: OUTPUT, drive_strength: R0_6, pull_keeper_select: Pull, pull_keeper_enable: Disable,
    pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '41', peripheral: GPIO3, signal: 'gpio_io, 19', pin_signal: GPIO_SD_B0_06, identifier: RS485_EN3, direction: OUTPUT, drive_strength: R0_6, pull_keeper_select: Pull,
    pull_keeper_enable: Disable, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '27', peripheral: GPIO3, signal: 'gpio_io, 24', pin_signal: GPIO_SD_B1_04, direction: OUTPUT, pull_keeper_select: Pull, pull_keeper_enable: Disable}
  - {pin_num: '116', peripheral: ENET, signal: enet_mdio, pin_signal: GPIO_EMC_40, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '115', peripheral: ENET, signal: enet_mdc, pin_signal: GPIO_EMC_41, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '82', peripheral: LPUART2, signal: TX, pin_signal: GPIO_AD_B1_08, identifier: UART2_TX, pull_keeper_enable: Disable}
  - {pin_num: '81', peripheral: LPUART2, signal: RX, pin_signal: GPIO_AD_B1_09, identifier: UART2_RX, pull_keeper_enable: Disable}
  - {pin_num: '100', peripheral: ENET, signal: enet_ref_clk, pin_signal: GPIO_AD_B0_08, slew_rate: Fast, software_input_on: Enable, speed: MHZ_200, drive_strength: R0_5,
    pull_keeper_select: Pull, pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '98', peripheral: ENET, signal: 'enet_rx_data, 0', pin_signal: GPIO_AD_B0_10, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '99', peripheral: ENET, signal: 'enet_rx_data, 1', pin_signal: GPIO_AD_B0_09, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '97', peripheral: ENET, signal: enet_rx_en, pin_signal: GPIO_AD_B0_11, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '96', peripheral: ENET, signal: enet_rx_er, pin_signal: GPIO_AD_B0_12, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '94', peripheral: ENET, signal: 'enet_tx_data, 0', pin_signal: GPIO_AD_B0_14, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '93', peripheral: ENET, signal: 'enet_tx_data, 1', pin_signal: GPIO_AD_B0_15, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '95', peripheral: ENET, signal: enet_tx_en, pin_signal: GPIO_AD_B0_13, slew_rate: Fast, speed: MHZ_200, drive_strength: R0_5, pull_keeper_select: Pull,
    pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '107', peripheral: GPIO1, signal: 'gpio_io, 04', pin_signal: GPIO_AD_B0_04, identifier: PHY_RST, direction: OUTPUT, gpio_init_state: 'true', drive_strength: R0_5,
    pull_keeper_select: Pull}
  - {pin_num: '84', peripheral: GPIO1, signal: 'gpio_io, 22', pin_signal: GPIO_AD_B1_06, identifier: PHY_INT, direction: INPUT, gpio_interrupt: kGPIO_IntLowLevel,
    slew_rate: Fast, drive_strength: R0_5, pull_keeper_select: Pull, pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '79', peripheral: ADC1, signal: 'IN, 11', pin_signal: GPIO_AD_B1_11}
  - {pin_num: '80', peripheral: ADC1, signal: 'IN, 10', pin_signal: GPIO_AD_B1_10}
  - {pin_num: '78', peripheral: ADC1, signal: 'IN, 12', pin_signal: GPIO_AD_B1_12}
  - {pin_num: '76', peripheral: ADC1, signal: 'IN, 13', pin_signal: GPIO_AD_B1_13}
  - {pin_num: '75', peripheral: ADC1, signal: 'IN, 14', pin_signal: GPIO_AD_B1_14}
  - {pin_num: '74', peripheral: ADC1, signal: 'IN, 15', pin_signal: GPIO_AD_B1_15}
  - {pin_num: '129', peripheral: GPIO2, signal: 'gpio_io, 27', pin_signal: GPIO_EMC_27, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable,
    pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '130', peripheral: GPIO2, signal: 'gpio_io, 26', pin_signal: GPIO_EMC_26, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable,
    pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '131', peripheral: GPIO2, signal: 'gpio_io, 25', pin_signal: GPIO_EMC_25, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable}
  - {pin_num: '132', peripheral: GPIO2, signal: 'gpio_io, 24', pin_signal: GPIO_EMC_24, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable}
  - {pin_num: '137', peripheral: GPIO2, signal: 'gpio_io, 21', pin_signal: GPIO_EMC_21, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable}
  - {pin_num: '138', peripheral: GPIO2, signal: 'gpio_io, 20', pin_signal: GPIO_EMC_20, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable}
  - {pin_num: '141', peripheral: GPIO2, signal: 'gpio_io, 17', pin_signal: GPIO_EMC_17, identifier: K7, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable}
  - {pin_num: '142', peripheral: GPIO2, signal: 'gpio_io, 16', pin_signal: GPIO_EMC_16, identifier: K8, direction: OUTPUT, pull_keeper_select: Keeper, pull_keeper_enable: Disable}
  - {pin_num: '92', peripheral: GPIO1, signal: 'gpio_io, 16', pin_signal: GPIO_AD_B1_00, direction: INPUT}
  - {pin_num: '91', peripheral: GPIO1, signal: 'gpio_io, 17', pin_signal: GPIO_AD_B1_01, direction: INPUT}
  - {pin_num: '90', peripheral: GPIO1, signal: 'gpio_io, 18', pin_signal: GPIO_AD_B1_02, direction: INPUT}
  - {pin_num: '89', peripheral: GPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AD_B1_03, direction: INPUT}
  - {pin_num: '88', peripheral: GPIO1, signal: 'gpio_io, 20', pin_signal: GPIO_AD_B1_04, direction: INPUT}
  - {pin_num: '87', peripheral: GPIO1, signal: 'gpio_io, 21', pin_signal: GPIO_AD_B1_05, direction: INPUT}
  - {pin_num: '46', peripheral: GPIO3, signal: 'gpio_io, 15', pin_signal: GPIO_SD_B0_02, identifier: DI_GUN1_FB, direction: INPUT}
  - {pin_num: '45', peripheral: GPIO3, signal: 'gpio_io, 16', pin_signal: GPIO_SD_B0_03, identifier: DI_GUN2_FB, direction: INPUT}
  - {pin_num: '83', peripheral: GPIO1, signal: 'gpio_io, 23', pin_signal: GPIO_AD_B1_07, direction: INPUT}
  - {pin_num: '119', peripheral: GPIO3, signal: 'gpio_io, 05', pin_signal: GPIO_EMC_37, identifier: DI_Door, direction: INPUT}
  - {pin_num: '120', peripheral: GPIO3, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_36, identifier: DI_Water, direction: INPUT}
  - {pin_num: '121', peripheral: GPIO3, signal: 'gpio_io, 03', pin_signal: GPIO_EMC_35, identifier: DI_Hit, direction: INPUT}
  - {pin_num: '122', peripheral: GPIO3, signal: 'gpio_io, 02', pin_signal: GPIO_EMC_34, direction: INPUT, pull_keeper_select: Pull, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: '18', peripheral: GPIO2, signal: 'gpio_io, 00', pin_signal: GPIO_EMC_00, identifier: DI_Scram, direction: INPUT}
  - {pin_num: '17', peripheral: GPIO2, signal: 'gpio_io, 01', pin_signal: GPIO_EMC_01, identifier: DI_SPD, direction: INPUT}
  - {pin_num: '108', peripheral: GPIO1, signal: 'gpio_io, 03', pin_signal: GPIO_AD_B0_03, direction: OUTPUT, pull_keeper_select: Keeper, pull_up_down_config: Pull_Down_100K_Ohm}
  - {pin_num: '14', peripheral: TMR1, signal: 'TIMER_OUTPUT, 0', pin_signal: GPIO_EMC_04, identifier: LED_OUT1}
  - {pin_num: '13', peripheral: TMR1, signal: 'TIMER_OUTPUT, 1', pin_signal: GPIO_EMC_05, identifier: LED_OUT2}
  - {pin_num: '7', peripheral: TMR1, signal: 'TIMER_OUTPUT, 2', pin_signal: GPIO_EMC_10, identifier: LED_OUT3}
  - {pin_num: '4', peripheral: TMR1, signal: 'TIMER_OUTPUT, 3', pin_signal: GPIO_EMC_11, identifier: LED_OUT4}
  - {pin_num: '140', peripheral: TMR2, signal: 'TIMER_OUTPUT, 0', pin_signal: GPIO_EMC_18, identifier: LED_OUT5}
  - {pin_num: '139', peripheral: TMR2, signal: 'TIMER_OUTPUT, 1', pin_signal: GPIO_EMC_19, identifier: LED_OUT6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

