Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           
  CLOCK_EnableClock(kCLOCK_Xbar1);            

  /* GPIO configuration of RS485_EN1 on GPIO_AD_B0_02 (pin 109) */
  gpio_pin_config_t RS485_EN1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_02 (pin 109) */
  GPIO_PinInit(GPIO1, 2U, &RS485_EN1_config);

  /* GPIO configuration of WDOG_B on GPIO_AD_B0_03 (pin 108) */
  gpio_pin_config_t WDOG_B_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_03 (pin 108) */
  GPIO_PinInit(GPIO1, 3U, &WDOG_B_config);

  /* GPIO configuration of LED_OUT1 on GPIO_EMC_04 (pin 14) */
  gpio_pin_config_t LED_OUT1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_04 (pin 14) */
  GPIO_PinInit(GPIO1, 4U, &LED_OUT1_config);

  /* GPIO configuration of LED_OUT2 on GPIO_EMC_05 (pin 13) */
  gpio_pin_config_t LED_OUT2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_05 (pin 13) */
  GPIO_PinInit(GPIO1, 5U, &LED_OUT2_config);

  /* GPIO configuration of LED_OUT5 on GPIO_EMC_18 (pin 140) */
  gpio_pin_config_t LED_OUT5_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_18 (pin 140) */
  GPIO_PinInit(GPIO1, 16U, &LED_OUT5_config);

  /* GPIO configuration of LED_OUT6 on GPIO_EMC_19 (pin 139) */
  gpio_pin_config_t LED_OUT6_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_19 (pin 139) */
  GPIO_PinInit(GPIO1, 17U, &LED_OUT6_config);

  /* GPIO configuration of DI_K1_FB on GPIO_AD_B1_02 (pin 90) */
  gpio_pin_config_t DI_K1_FB_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_02 (pin 90) */
  GPIO_PinInit(GPIO1, 18U, &DI_K1_FB_config);

  /* GPIO configuration of DI_K2_FB on GPIO_AD_B1_03 (pin 89) */
  gpio_pin_config_t DI_K2_FB_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin 89) */
  GPIO_PinInit(GPIO1, 19U, &DI_K2_FB_config);

  /* GPIO configuration of DI_K3_FB on GPIO_AD_B1_04 (pin 88) */
  gpio_pin_config_t DI_K3_FB_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_04 (pin 88) */
  GPIO_PinInit(GPIO1, 20U, &DI_K3_FB_config);

  /* GPIO configuration of DI_K4_FB on GPIO_AD_B1_05 (pin 87) */
  gpio_pin_config_t DI_K4_FB_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_05 (pin 87) */
  GPIO_PinInit(GPIO1, 21U, &DI_K4_FB_config);

  /* GPIO configuration of PHY_INT on GPIO_AD_B1_06 (pin 84) */
  gpio_pin_config_t PHY_INT_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntLowLevel
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_06 (pin 84) */
  GPIO_PinInit(GPIO1, 22U, &PHY_INT_config);
  /* Enable GPIO pin interrupt on GPIO_AD_B1_06 (pin 84) */
  GPIO_PortEnableInterrupts(GPIO1, 1U << 22U);

  /* GPIO configuration of DI_MCB on GPIO_AD_B1_07 (pin 83) */
  gpio_pin_config_t DI_MCB_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_07 (pin 83) */
  GPIO_PinInit(GPIO1, 23U, &DI_MCB_config);

  /* GPIO configuration of DI_Scram on GPIO_EMC_00 (pin 18) */
  gpio_pin_config_t DI_Scram_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_00 (pin 18) */
  GPIO_PinInit(GPIO2, 0U, &DI_Scram_config);

  /* GPIO configuration of DI_SPD on GPIO_EMC_01 (pin 17) */
  gpio_pin_config_t DI_SPD_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_01 (pin 17) */
  GPIO_PinInit(GPIO2, 1U, &DI_SPD_config);

  /* GPIO configuration of K8 on GPIO_EMC_16 (pin 142) */
  gpio_pin_config_t K8_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_16 (pin 142) */
  GPIO_PinInit(GPIO2, 16U, &K8_config);

  /* GPIO configuration of K7 on GPIO_EMC_17 (pin 141) */
  gpio_pin_config_t K7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_17 (pin 141) */
  GPIO_PinInit(GPIO2, 17U, &K7_config);

  /* GPIO configuration of K6 on GPIO_EMC_20 (pin 138) */
  gpio_pin_config_t K6_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_20 (pin 138) */
  GPIO_PinInit(GPIO2, 20U, &K6_config);

  /* GPIO configuration of K5 on GPIO_EMC_21 (pin 137) */
  gpio_pin_config_t K5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_21 (pin 137) */
  GPIO_PinInit(GPIO2, 21U, &K5_config);

  /* GPIO configuration of CD4052_CHA on GPIO_EMC_22 (pin 136) */
  gpio_pin_config_t CD4052_CHA_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_22 (pin 136) */
  GPIO_PinInit(GPIO2, 22U, &CD4052_CHA_config);

  /* GPIO configuration of CD4052_CHB on GPIO_EMC_23 (pin 133) */
  gpio_pin_config_t CD4052_CHB_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_23 (pin 133) */
  GPIO_PinInit(GPIO2, 23U, &CD4052_CHB_config);

  /* GPIO configuration of K4 on GPIO_EMC_24 (pin 132) */
  gpio_pin_config_t K4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_24 (pin 132) */
  GPIO_PinInit(GPIO2, 24U, &K4_config);

  /* GPIO configuration of K3 on GPIO_EMC_25 (pin 131) */
  gpio_pin_config_t K3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_25 (pin 131) */
  GPIO_PinInit(GPIO2, 25U, &K3_config);

  /* GPIO configuration of K2 on GPIO_EMC_26 (pin 130) */
  gpio_pin_config_t K2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_26 (pin 130) */
  GPIO_PinInit(GPIO2, 26U, &K2_config);

