Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/board/pin_mux.c
  /* GPIO configuration of K1 on GPIO_EMC_27 (pin 129) */
  gpio_pin_config_t K1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_27 (pin 129) */
  GPIO_PinInit(GPIO2, 27U, &K1_config);

  /* GPIO configuration of WDI_PFO on GPIO_EMC_34 (pin 122) */
  gpio_pin_config_t WDI_PFO_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_34 (pin 122) */
  GPIO_PinInit(GPIO3, 2U, &WDI_PFO_config);

  /* GPIO configuration of DI_Hit on GPIO_EMC_35 (pin 121) */
  gpio_pin_config_t DI_Hit_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_35 (pin 121) */
  GPIO_PinInit(GPIO3, 3U, &DI_Hit_config);

  /* GPIO configuration of DI_Water on GPIO_EMC_36 (pin 120) */
  gpio_pin_config_t DI_Water_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_36 (pin 120) */
  GPIO_PinInit(GPIO3, 4U, &DI_Water_config);

  /* GPIO configuration of DI_Door on GPIO_EMC_37 (pin 119) */
  gpio_pin_config_t DI_Door_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_37 (pin 119) */
  GPIO_PinInit(GPIO3, 5U, &DI_Door_config);

  /* GPIO configuration of RS485_EN2 on GPIO_SD_B0_00 (pin 48) */
  gpio_pin_config_t RS485_EN2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B0_00 (pin 48) */
  GPIO_PinInit(GPIO3, 13U, &RS485_EN2_config);

  /* GPIO configuration of DI_GUN1_FB on GPIO_SD_B0_02 (pin 46) */
  gpio_pin_config_t DI_GUN1_FB_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B0_02 (pin 46) */
  GPIO_PinInit(GPIO3, 15U, &DI_GUN1_FB_config);

  /* GPIO configuration of DI_GUN2_FB on GPIO_SD_B0_03 (pin 45) */
  gpio_pin_config_t DI_GUN2_FB_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B0_03 (pin 45) */
  GPIO_PinInit(GPIO3, 16U, &DI_GUN2_FB_config);

  /* GPIO configuration of RS485_EN3 on GPIO_SD_B0_06 (pin 41) */
  gpio_pin_config_t RS485_EN3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B0_06 (pin 41) */
  GPIO_PinInit(GPIO3, 19U, &RS485_EN3_config);

  /* GPIO configuration of RS485_EN4 on GPIO_SD_B1_04 (pin 27) */
  gpio_pin_config_t RS485_EN4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_04 (pin 27) */
  GPIO_PinInit(GPIO3, 24U, &RS485_EN4_config);

  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_04_GPIO1_IO04, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_05_GPIO1_IO05, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_08_ENET_REF_CLK1, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_09_ENET_RDATA01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_10_ENET_RDATA00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_11_ENET_RX_EN, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_12_ENET_RX_ER, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_13_ENET_TX_EN, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_14_ENET_TDATA00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_15_ENET_TDATA01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_GPIO1_IO18, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_08_LPUART2_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_09_LPUART2_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_13_GPIO1_IO29, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_14_GPIO1_IO30, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_15_GPIO1_IO31, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_00_GPIO2_IO00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_01_GPIO2_IO01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_02_LPI2C1_SCL, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_03_LPI2C1_SDA, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_04_XBAR1_INOUT04, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_05_XBAR1_INOUT05, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_06_LPUART3_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_07_LPUART3_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_08_FLEXCAN2_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_09_FLEXCAN2_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_10_XBAR1_INOUT10, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_11_XBAR1_INOUT11, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_12_LPUART6_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_13_LPUART6_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_16_GPIO2_IO16, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_17_GPIO2_IO17, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_18_XBAR1_INOUT16, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_19_XBAR1_INOUT17, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_20_GPIO2_IO20, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_21_GPIO2_IO21, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_22_GPIO2_IO22, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_23_GPIO2_IO23, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_24_GPIO2_IO24, 1U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_25_GPIO2_IO25, 1U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_26_GPIO2_IO26, 1U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_27_GPIO2_IO27, 1U);
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_32_LPUART4_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_33_LPUART4_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_34_GPIO3_IO02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_35_GPIO3_IO03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_36_GPIO3_IO04, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_37_GPIO3_IO05, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_38_LPUART5_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_39_LPUART5_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_40_ENET_MDIO, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_41_ENET_MDC, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_00_GPIO3_IO13, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_01_XBAR1_INOUT15, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_02_GPIO3_IO15, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_03_GPIO3_IO16, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_04_LPUART7_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_05_LPUART7_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_06_GPIO3_IO19, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_FLEXCAN1_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_FLEXCAN1_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_LPUART8_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_LPUART8_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO3_IO24, 0U); 
  IOMUXC_GPR->GPR6 = ((IOMUXC_GPR->GPR6 &
    (~(IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_4_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_5_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_10_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_11_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_15_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_16_MASK | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_17_MASK))) 
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_4(0x01U) 
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_5(0x01U) 
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_10(0x01U) 
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_11(0x01U) 
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_15(0x01U) 
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_16(0x01U) 
      | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_17(0x01U) 
    );
  XBARA_SetSignalsConnection(XBARA, kXBARA1_InputQtimer1Tmr0, kXBARA1_OutputIomuxXbarInout04); 
  XBARA_SetSignalsConnection(XBARA, kXBARA1_InputQtimer1Tmr1, kXBARA1_OutputIomuxXbarInout05); 
  XBARA_SetSignalsConnection(XBARA, kXBARA1_InputQtimer1Tmr2, kXBARA1_OutputIomuxXbarInout10); 
  XBARA_SetSignalsConnection(XBARA, kXBARA1_InputQtimer1Tmr3, kXBARA1_OutputIomuxXbarInout11); 
  XBARA_SetSignalsConnection(XBARA, kXBARA1_InputQtimer2Tmr2, kXBARA1_OutputIomuxXbarInout15); 
  XBARA_SetSignalsConnection(XBARA, kXBARA1_InputQtimer2Tmr0, kXBARA1_OutputIomuxXbarInout16); 
  XBARA_SetSignalsConnection(XBARA, kXBARA1_InputQtimer2Tmr1, kXBARA1_OutputIomuxXbarInout17); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 0x20B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0x10A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_04_GPIO1_IO04, 0xB0A9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_05_GPIO1_IO05, 0x60A0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_08_ENET_REF_CLK1, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_09_ENET_RDATA01, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_10_ENET_RDATA00, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_11_ENET_RX_EN, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_12_ENET_RX_ER, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_13_ENET_TX_EN, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_14_ENET_TDATA00, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_15_ENET_TDATA01, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0xB0A9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_08_LPUART2_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_09_LPUART2_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_02_LPI2C1_SCL, 0xD8B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_03_LPI2C1_SDA, 0xD8B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_06_LPUART3_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_07_LPUART3_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_08_FLEXCAN2_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_09_FLEXCAN2_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_12_LPUART6_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_13_LPUART6_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_16_GPIO2_IO16, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_17_GPIO2_IO17, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_20_GPIO2_IO20, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_21_GPIO2_IO21, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_22_GPIO2_IO22, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_23_GPIO2_IO23, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_24_GPIO2_IO24, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_25_GPIO2_IO25, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_26_GPIO2_IO26, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_27_GPIO2_IO27, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_32_LPUART4_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_33_LPUART4_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_34_GPIO3_IO02, 0x70B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_38_LPUART5_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_39_LPUART5_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_40_ENET_MDIO, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_41_ENET_MDC, 0xB0E9U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_00_GPIO3_IO13, 0x20B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_01_XBAR1_INOUT15, 0x10B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_04_LPUART7_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_05_LPUART7_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_06_GPIO3_IO19, 0x20B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_00_FLEXCAN1_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_01_FLEXCAN1_RX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_LPUART8_TX, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_LPUART8_RX, 0x70B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_GPIO3_IO24, 0x20B0U); 
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
